burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_FMC_VALID_ADDRESS(address)) || (0U != ((address) % 16U))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_FMC_VALID_BLANK_ADDRESS_CONFIG(address, length)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if((address >= MFLASH_BASE_ADDRESS) && (address < (MFLASH_BASE_ADDRESS + MFLASH_SIZE))) {
            FMC_CTL &= ~FMC_CTL_BKSEL;
            /* start check blank command */
            FMC_ADDR = address;
            FMC_CTL &= ~FMC_CTL_CBCMDLEN;
            FMC_CTL |= (uint32_t)length << CTL_CBCMDLEN_OFFSET;
            FMC_CTL |= FMC_CTL_CBCMD;
            FMC_CTL |= FMC_CTL_START;

            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            /* reset the CBCMD bit */
            FMC_CTL &= ~FMC_CTL_CBCMD;
        } else {
            FMC_CTL |= FMC_CTL_BKSEL;
            /* start check blank command */
            FMC_ADDR = address;
            FMC_CTL &= ~FMC_CTL_CBCMDLEN;
            FMC_CTL |= (uint32_t)length << CTL_CBCMDLEN_OFFSET;
            FMC_CTL |= FMC_CTL_CBCMD;
            FMC_CTL |= FMC_CTL_START;

            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            /* reset the CBCMD bit */
            FMC_CTL &= ~FMC_CTL_CBCMD;
            /* reset the BKSEL bit */
            FMC_CTL &= ~FMC_CTL_BKSEL;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      erase main flash or data flash page (API_ID(0x000FU))
    \param[in]  page_address: target page start address
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_page_erase(uint32_t page_address)
{
    fmc_state_enum fmc_state = FMC_READY;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_ADDRESS(page_address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        if((page_address >= MFLASH_BASE_ADDRESS) && (page_address < (MFLASH_BASE_ADDRESS + MFLASH_SIZE))) {
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                /* start page erase */
                FMC_CTL &= ~FMC_CTL_BKSEL;
                FMC_CTL |= FMC_CTL_PER;
                FMC_ADDR = page_address;
                FMC_CTL |= FMC_CTL_START;

                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PER bit */
                FMC_CTL &= ~FMC_CTL_PER;
            }
        } else {
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                /* start page erase */
                FMC_CTL |= FMC_CTL_BKSEL;
                FMC_CTL |= FMC_CTL_PER;
                FMC_ADDR = page_address;
                FMC_CTL |= FMC_CTL_START;

                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PER bit */
                FMC_CTL &= ~FMC_CTL_PER;
                /* reset the BKSEL bit */
                FMC_CTL &= ~FMC_CTL_BKSEL;
            }
        }
    }

    /* return the FMC state  */
    return fmc_state;
}

/*!
    \brief      erase main flash (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_mflash_mass_erase(void)
{
    fmc_state_enum fmc_state;
    /* wait for the FMC ready */
    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start whole chip erase */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        FMC_CTL |= FMC_CTL_MER;
        FMC_CTL |= FMC_CTL_START;
        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the MER bit */
        FMC_CTL &= ~FMC_CTL_MER;
    }

    /* return the FMC state  */
    return fmc_state;
}

/*!
    \brief      erase data flash (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_dflash_mass_erase(void)
{
    fmc_state_enum fmc_state;
    /* wait for the FMC ready */
    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start chip erase */
        FMC_CTL |= FMC_CTL_BKSEL;
        FMC_CTL |= FMC_CTL_MER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the MER bit */
        FMC_CTL &= ~FMC_CTL_MER;
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
    }
    /* return the fmc state  */
    return fmc_state;
}

/*!
    \brief      erase whole chip (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_mass_erase(void)
{
    fmc_state_enum fmc_state;

    /* mass erase main flash */
    fmc_state = fmc_mflash_mass_erase();

    if(FMC_READY == fmc_state) {
        /* mass erase data flash */
        fmc_state = fmc_dflash_mass_erase();
    }

    /* return the fmc state */
    return fmc_state;
}

/*!
    \brief      FMC program four words at the corresponding address (API_ID(0x0013U))
    \param[in]  address: address to program
    \param[in]  data_l: low 64-bit to program
    \param[in]  data_h: high 64-bit to program
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_fourword_program(uint32_t address, uint64_t data_l, uint64_t data_h)
{
    fmc_state_enum fmc_state;

