burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_FMC_VALID_ADDRESS(address)) || (0U != ((address) % 16U))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0013U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        if((address >= MFLASH_BASE_ADDRESS) && (address < (MFLASH_BASE_ADDRESS + MFLASH_SIZE))) {
            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                FMC_CTL &= ~FMC_CTL_BKSEL;
                FMC_CTL |= FMC_CTL_PG;
                REG32(address) = (uint32_t)(data_l & 0x00000000FFFFFFFFU);
                REG32(address + 4U) = (uint32_t)(data_l >> 32U);
                REG32(address + 8U) = (uint32_t)(data_h & 0x00000000FFFFFFFFU);
                REG32(address + 12U) = (uint32_t)(data_h >> 32U);

                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PG */
                FMC_CTL &= ~FMC_CTL_PG;
            }
        } else {
            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                FMC_CTL |= FMC_CTL_BKSEL;
                FMC_CTL |= FMC_CTL_PG;
                REG32(address) = (uint32_t)(data_l & 0x00000000FFFFFFFFU);
                REG32(address + 4U) = (uint32_t)(data_l >> 32U);
                REG32(address + 8U) = (uint32_t)(data_h & 0x00000000FFFFFFFFU);
                REG32(address + 12U) = (uint32_t)(data_h >> 32U);

                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PG */
                FMC_CTL &= ~FMC_CTL_PG;
                /* reset the BKSEL bit */
                FMC_CTL &= ~FMC_CTL_BKSEL;
            }
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      FMC fast program one row data (16 four words) starting at the corresponding address (API_ID(0x0014U))
    \param[in]  address: address to program
    \param[in]  data: data buffer to program
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_fast_program(uint32_t address, uint64_t data[])
{
    uint8_t index;
    fmc_state_enum fmc_state;
    uint8_t cache_en = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((NOT_FMC_VALID_ADDRESS(address)) || (0U != ((address) % 64U))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0014U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif
    {
        if((address >= MFLASH_BASE_ADDRESS) && (address < (MFLASH_BASE_ADDRESS + MFLASH_SIZE))) {
            /* check the row (16 four words) in flash to confirm all data in main flash is all 0xFF */
            fmc_state = fmc_blank_check(address, CBCMDLEN_OF_ONE_ROW_MAIN);
            if(FMC_CBCMDERR != fmc_state) {
                /* flush the cache if it is enabled */
                if(FMC_WS & FMC_WS_DCEN) {
                    cache_en = 1U;
                    fmc_dbus_disable();
                }
                fmc_dbus_reset_enable();
                fmc_dbus_reset_disable();

                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                if(FMC_READY == fmc_state) {
                    /* set the FSTPG bit to start program */
                    FMC_CTL |= FMC_CTL_FSTPG;
                    FMC_ADDR = address;
                    /* program the row data */
                    for(index = 0U; index < DOUBLEWORD_CNT_IN_ROW; index++) {
                        FMC_DATA = (uint32_t)(data[index] & 0x00000000FFFFFFFFU);
                        FMC_DATA = (uint32_t)(data[index] >> 32U);
                    }
                    /* set START bit to launch fast program operation to flash */
                    FMC_CTL |= FMC_CTL_START;

                    /* wait for the FMC ready */
                    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                    /* reset the FSTPG bit */
                    FMC_CTL &= ~FMC_CTL_FSTPG;
                }
            }
        } else {
            /* check the row (8 double-word) in flash to confirm all data in data flash is all 0xFF */
            fmc_state = fmc_blank_check(address, CBCMDLEN_OF_ONE_ROW_DATA);
            if(FMC_CBCMDERR != fmc_state) {
                /* flush the cache if it is enabled */
                if(FMC_WS & FMC_WS_DCEN) {
                    cache_en = 1U;
                    fmc_dbus_disable();
                }
                fmc_dbus_reset_enable();
                fmc_dbus_reset_disable();

                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                if(FMC_READY == fmc_state) {
                    FMC_CTL |= FMC_CTL_BKSEL;
                    /* set the FSTPG bit to start program */
                    FMC_CTL |= FMC_CTL_FSTPG;
                    FMC_ADDR = address;
                    /* program the row data */
                    for(index = 0U; index < DOUBLEWORD_DATA_CNT_IN_ROW; index++) {
                        FMC_DATA = (uint32_t)(data[index] & 0x00000000FFFFFFFFU);
                        FMC_DATA = (uint32_t)(data[index] >> 32U);
                    }

