burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
                    /* set START bit to launch fast program operation to flash */
                    FMC_CTL |= FMC_CTL_START;

                    /* wait for the FMC ready */
                    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

                    /* reset the FSTPG bit */
                    FMC_CTL &= ~FMC_CTL_FSTPG;
                    /* reset the BKSEL bit */
                    FMC_CTL &= ~FMC_CTL_BKSEL;
                }
            }
        }
        if(1U == cache_en) {
            fmc_dbus_enable();
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      FMC program a word at the corresponding address in OTP (API_ID(0x0015U))
    \param[in]  address: address to program
    \param[in]  data_l: low 64-bit data to program
    \param[in]  data_h: high 64-bit data to program
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGSERR:  program sequence error
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_CBCMDERR: the checked area not blank error
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_otp_fourword_program(uint32_t address, uint64_t data_l, uint64_t data_h)
{
    fmc_state_enum fmc_state;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_VALID_OTP_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0015U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state) {
            FMC_CTL |= FMC_CTL_BKSEL;
            /* set the PG bit to start program */
            FMC_CTL |= FMC_CTL_PG;
            REG32(address) = (uint32_t)(data_l & 0x00000000FFFFFFFFU);
            REG32(address + 4U) = (uint32_t)(data_l >> 32U);
            REG32(address + 8U) = (uint32_t)(data_h & 0x00000000FFFFFFFFU);
            REG32(address + 12U) = (uint32_t)(data_h >> 32U);

            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            /* reset the PG bit */
            FMC_CTL &= ~FMC_CTL_PG;

            FMC_CTL &= ~FMC_CTL_BKSEL;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      unlock the option byte operation (API_ID(0x0016U))
                it is better to used in pairs with ob_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(RESET == (FMC_CTL & FMC_CTL_OBWEN)) {
        /* write the FMC key */
        FMC_OBKEY = UNLOCK_KEY0;
        FMC_OBKEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option byte operation (API_ID(0x0017U))
                it is better to used in pairs with ob_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_lock(void)
{
    /* reset the OBWEN bit */
    FMC_CTL &= ~FMC_CTL_OBWEN;
}

/*!
    \brief      reload the option byte and generate a system reset (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reset(void)
{
    /* set the OBRLD bit */
    FMC_CTL |= FMC_CTL_OBRLD;
}

/*!
    \brief      erase the FMC option bytes (API_ID(0x0019U))
                programmer must ensure FMC & option byte are both unlocked before calling this function
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_erase(void)
{
    uint8_t temp_spc;
    fmc_state_enum fmc_state;

    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    temp_spc = (uint8_t)OB_SPC_USER;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option bytes */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            /* restore the last get option byte security protection code */
            OB_SPC_USER = (temp_spc & LOW_8BITS_MASK) | LOW_8BITS_MASK1;
            OB_DATA = OB_DEFAULT;
            OB_WP0 = OB_DEFAULT;
            OB_WP1 = OB_DEFAULT;
            OB_USER1_WWDGT0 = OB_DEFAULT;
            OB_WWDGT1_WWDGT2 = OB_DEFAULT;
            OB_FWDGT0_FWDGT1 = OB_DEFAULT;
            OB_FWDGT2_FWDGT3 = OB_DEFAULT;

            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      enable write protection (API_ID(0x001AU))
    \param[in]  ob_wp: specify sector to be write protected, refer to fmc_ob_wp_enum
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_write_protection_enable(fmc_ob_wp_enum ob_wp)
{
    uint32_t temp_spc;
    uint32_t temp;
    uint32_t i;
    uint32_t op_byte[8];
    fmc_state_enum fmc_state;

    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    temp_spc = OB_SPC_USER;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    for(i = 0U; i < 8U; i++) {
        op_byte[i] = OP_BYTE(i);
    }

