burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
    temp      = (uint32_t)(~ob_wp);
    op_byte[2] = (temp & LOW_8BITS_MASK) | ((temp & HIGH_8BITS_MASK) << 8U);
    op_byte[3] = ((temp & LOW_8BITS_MASK1) >> 16U) | ((temp & HIGH_8BITS_MASK1) >> 8U);

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            for(i = 0U; i < 8U; i++) {
                OP_BYTE(i) = op_byte[i];
                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure security protection (API_ID(0x001BU))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_spc: specify security protection
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_security_protection_config(uint8_t ob_spc)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t op_byte[8];
    fmc_state_enum fmc_state;

    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    temp_spc = OB_SPC_USER & LOW_16BITS_MASK;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    for(i = 0U; i < 8U; i++) {
        op_byte[i] = OP_BYTE(i);
    }

    op_byte[0] = ((uint32_t)(ob_spc)) | ((op_byte[0] & HIGH_16BITS_MASK));

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            for(i = 0U; i < 8U; i++) {
                OP_BYTE(i) = op_byte[i];
                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program option bytes USER (API_ID(0x001CU))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  optionbyte_user: option bytes user structure and the member values are shown as below:
                  nfwdg_hw: OB_FWDGT_HW, OB_FWDGT_SW
                  nrst_dpslp: OB_DEEPSLEEP_RST, OB_DEEPSLEEP_NRST
                  nrst_stdby: OB_STDBY_RST, OB_STDBY_NRST
                  lvd0en: OB_LVDOEN_ENABLE, OB_LVDOEN_DISABLE
                  fwdgspd_dpslp: OB_FWDGDPSLP_ENABLE, OB_FWDGDPSLP_DISABLE
                  fwdgt_standby: OB_FWDGSTANDBY_ENABLE, OB_FWDGSTANDBY_DISABLE
                  lvd0t: OB_LVD0T_VALUE2, OB_LVD0T_VALUE3
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_user_write(optionbyte_user_struct *optionbyte_user)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t temp;
    uint32_t op_byte[8];
    fmc_state_enum fmc_state;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(optionbyte_user)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

        temp_spc = OB_SPC_USER;

        /* check the option bytes security protection value */
        if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
            fmc_state = FMC_OB_HSPC;
        }

        for(i = 0U; i < 8U; i++) {
            op_byte[i] = OP_BYTE(i);
        }

        temp = (uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(optionbyte_user->nfwdg_hw & OB_FWDGT_SW)
                                             | (uint8_t)(optionbyte_user->nrst_dpslp & OB_DEEPSLEEP_NRST)) | (uint8_t)(optionbyte_user->nrst_stdby & OB_STDBY_NRST))
                                             | (uint8_t)(optionbyte_user->lvd0en & OB_LVDOEN_DISABLE)) | (uint8_t)(optionbyte_user->fwdgspd_dpslp &
                                                     OB_FWDGDPSLP_DISABLE)) | (uint8_t)(optionbyte_user->lvd0t & OB_LVD0T_VALUE3))
                                             | (uint8_t)(optionbyte_user->fwdgspd_stdby & OB_FWDGSTANDBY_DISABLE));

