burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
        op_byte[0] = ((uint32_t)(temp) << 16U) | ((op_byte[0] & LOW_16BITS_MASK));

        if(FMC_READY == fmc_state) {
            FMC_CTL |= FMC_CTL_BKSEL;
            /* start erase the option byte */
            FMC_CTL |= FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_START;

            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
            /* reset the BKSEL bit */
            FMC_CTL &= ~FMC_CTL_BKSEL;
            if(FMC_READY == fmc_state) {
                /* reset the OBER bit and enable the option bytes programming */
                FMC_CTL &= ~FMC_CTL_OBER;
                FMC_CTL |= FMC_CTL_OBPG;

                for(i = 0U; i < 8U; i++) {
                    OP_BYTE(i) = op_byte[i];
                    /* wait for the FMC ready */
                    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                    if(FMC_READY != fmc_state) {
                        break;
                    }
                }

                /* reset the OBPG bit */
                FMC_CTL &= ~FMC_CTL_OBPG;
            } else {
                /* reset the OBER bit */
                FMC_CTL &= ~FMC_CTL_OBER;
            }
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program option bytes data (API_ID(0x001DU))
    \param[in]  ob_data: the byte to be programmed
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/

fmc_state_enum ob_data_program(uint16_t ob_data)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t op_byte[8];

    fmc_state_enum fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    temp_spc = OB_SPC_USER;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    for(i = 0U; i < 8U; i++) {
        op_byte[i] = OP_BYTE(i);
    }

    op_byte[1] = (uint32_t)((ob_data & LOW_8BITS_MASK) | ((ob_data & HIGH_8BITS_MASK) << 8U));

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            for(i = 0U; i < 8U; i++) {
                OP_BYTE(i) = op_byte[i];
                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program option bytes USER1 (API_ID(0x001EU))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_wwdg_hw: window watchdog select hardware or software
                only one parameter can be selected which are shown as below:
      \arg        OB_WWDGT_HW: select hardware window watchdog
      \arg        OB_WWDGT_SW: select software window watchdog
    \param[in]  ob_sram_ecc: sram ECC error check
                only one parameter can be selected which are shown as below:
      \arg        OB_SRAMECC_DISABLE: sram ecc disable
      \arg        OB_SRAMECC_ENABLE: sram ecc enable
    \param[in]  ob_swd_mode: swd off or on
                only one parameter can be selected which are shown as below:
      \arg        OB_SWD_DISABLE: swd disable
      \arg        OB_SWD_ENABLE: swd enable
    \param[in]  ob_nrst_mod: reset input/output
                only one parameter can be selected which are shown as below:
      \arg        OB_NRST_MODE_VALUE1: nrst mode = 1
      \arg        OB_NRST_MODE_VALUE2: nrst mode = 2
      \arg        OB_NRST_MODE_VALUE3: nrst mode = 3
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_user1_write(uint8_t ob_wwdg_hw, uint8_t ob_sram_ecc, uint8_t ob_swd_mode, uint8_t ob_nrst_mod)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t temp;
    uint32_t op_byte[8];
    fmc_state_enum fmc_state;

    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    temp_spc = OB_SPC_USER;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    for(i = 0U; i < 8U; i++) {
        op_byte[i] = OP_BYTE(i);
    }

    temp = (uint8_t)((uint8_t)((uint8_t)((uint8_t)(ob_wwdg_hw & OB_WWDGT_SW)
                                         | (uint8_t)(ob_sram_ecc & OB_SRAMECC_ENABLE))
                               | (uint8_t)(ob_swd_mode & OB_SWD_ENABLE))
                     | (uint8_t)(ob_nrst_mod & OB_NRST_MODE_VALUE3));

    op_byte[4] = (uint32_t)(temp) | ((op_byte[4] & HIGH_16BITS_MASK));

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            for(i = 0U; i < 8U; i++) {
                OP_BYTE(i) = op_byte[i];
                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

