burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program option bytes WWDGT0 (API_ID(0x001FU))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  optionbyte_wwdg0: option bytes wwdg0 structure and the member values are shown as below:
                  psc: OB_WWDG_PSC8, OB_WWDG_PSC4, OB_WWDG_PSC2, OB_WWDG_PSC1
                  wsps: OB_WSPS_VALUE25, OB_WSPS_VALUE50, OB_WSPS_VALUE75, OB_WSPS_VALUE100
                  weps: OB_WEPS_VALUE75, OB_WEPS_VALUE50, OB_WEPS_VALUE25, OB_WEPS_VALUE0
                  ewie: OB_EWIE_ENABLE, OB_EWIE_DISABLE
                  wdga: OB_WWDGT_RST_DISABLE, OB_WWDGT_RST_ENABLE
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_wwdgt0_write(optionbyte_wwdgt0_struct *optionbyte_wwdg0)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t temp;
    uint32_t op_byte[8];
    fmc_state_enum fmc_state;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(optionbyte_wwdg0)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

        temp_spc = OB_SPC_USER;

        /* check the option bytes security protection value */
        if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
            fmc_state = FMC_OB_HSPC;
        }

        for(i = 0U; i < 8U; i++) {
            op_byte[i] = OP_BYTE(i);
        }

        temp = (uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(optionbyte_wwdg0->psc & OB_WWDG_PSC1) |
                                             (uint8_t)(optionbyte_wwdg0->wsps & OB_WSPS_VALUE100)) |
                                             (uint8_t)(optionbyte_wwdg0->weps & OB_WEPS_VALUE0)) | (uint8_t)(optionbyte_wwdg0->ewie & OB_EWIE_DISABLE)) |
                                             (uint8_t)(optionbyte_wwdg0->wdga & OB_WWDGT_RST_ENABLE));

        op_byte[4] = ((uint32_t)(temp) << 16U) | ((op_byte[4] & LOW_16BITS_MASK));

        if(FMC_READY == fmc_state) {
            FMC_CTL |= FMC_CTL_BKSEL;
            /* start erase the option byte */
            FMC_CTL |= FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_START;

            /* wait for the FMC ready */
            fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
            /* reset the BKSEL bit */
            FMC_CTL &= ~FMC_CTL_BKSEL;
            if(FMC_READY == fmc_state) {
                /* reset the OBER bit and enable the option bytes programming */
                FMC_CTL &= ~FMC_CTL_OBER;
                FMC_CTL |= FMC_CTL_OBPG;

                for(i = 0U; i < 8U; i++) {
                    OP_BYTE(i) = op_byte[i];
                    /* wait for the FMC ready */
                    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                    if(FMC_READY != fmc_state) {
                        break;
                    }
                }

                /* reset the OBPG bit */
                FMC_CTL &= ~FMC_CTL_OBPG;
            } else {
                /* reset the OBER bit */
                FMC_CTL &= ~FMC_CTL_OBER;
            }
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program option bytes WWDGT1 and WWDGT2 (API_ID(0x0020U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_wwdg_cnt: value in auto-start mode, 0 ~ 0x00003FFFU
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_wwdgt1_wwdgt2_write(uint16_t ob_wwdg_cnt)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t op_byte[8];
    fmc_state_enum fmc_state;

    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);

    temp_spc = OB_SPC_USER & LOW_16BITS_MASK;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    for(i = 0U; i < 8U; i++) {
        op_byte[i] = OP_BYTE(i);
    }

    op_byte[5] = (uint32_t)((uint32_t)(((uint32_t)ob_wwdg_cnt & OB_WWDG_CNT_MASK0) << OB_WWDG_CNT_OFFSET0) | ((
                                uint32_t)ob_wwdg_cnt & OB_WWDG_CNT_MASK1) >> OB_WWDG_CNT_OFFSET1);

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            for(i = 0U; i < 8U; i++) {
                OP_BYTE(i) = op_byte[i];
                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program option bytes FWDGT0 and FWDGT1 and FWDGT2 and FWDGT3 (API_ID(0x0021U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_fwdgt_wnd: hardware free watchdog window value, 0 ~ 0x00000FFFU
    \param[in]  ob_fwdgt_psc: free watchdog timer prescaler selection
                only one parameter can be selected which are shown as below:
      \arg        OB_FWDGT_PSC4: free watchdog timer prescaler selection 1/4
      \arg        OB_FWDGT_PSC8: free watchdog timer prescaler selection 1/8
      \arg        OB_FWDGT_PSC16: free watchdog timer prescaler selection 1/16
      \arg        OB_FWDGT_PSC32: free watchdog timer prescaler selection 1/32
      \arg        OB_FWDGT_PSC64: free watchdog timer prescaler selection 1/64
      \arg        OB_FWDGT_PSC128: free watchdog timer prescaler selection 1/128
      \arg        OB_FWDGT_PSC256: free watchdog timer prescaler selection 1/256
    \param[in]  ob_fwdgt_rst: fwdgt to generate a reset
                only one parameter can be selected which are shown as below:
      \arg        OB_FWDGT_RST_DISABLE: disable fwdgt to generate a reset
      \arg        OB_FWDGT_RST_ENABLE: enable fwdgt to generate a reset
    \param[in]  ob_fwdgt_reload: fwdgt reload value, 0 ~ 0x00000FFFU
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum ob_fwdgt_write(uint16_t ob_fwdgt_wnd, uint8_t ob_fwdgt_psc, uint8_t ob_fwdgt_rst,
                              uint16_t ob_fwdgt_reload)
{
    uint32_t temp_spc;
    uint8_t i;
    uint32_t op_byte[8];

    fmc_state_enum fmc_state;

    fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
    temp_spc = OB_SPC_USER & LOW_16BITS_MASK;

    /* check the option bytes security protection value */
    if((RESET != ob_security_protection_flag_get()) && (FMC_HSPC == (temp_spc & LOW_8BITS_MASK))) {
        fmc_state = FMC_OB_HSPC;
    }

    for(i = 0U; i < 8U; i++) {
        op_byte[i] = OP_BYTE(i);
    }
    op_byte[6] = (uint32_t)(((uint32_t)ob_fwdgt_wnd & OB_FWDG_WND_MASK0) | ((uint32_t)ob_fwdgt_psc & OB_FWDG_PSC_MASK) | ((uint32_t)ob_fwdgt_rst & OB_FWDGT_RST_ENABLE));
    op_byte[7] = (uint32_t)((uint32_t)ob_fwdgt_wnd & OB_FWDG_WND_MASK1);
    op_byte[6] = (uint32_t)(ob_fwdgt_reload & LOW_8BITS_MASK) | (uint32_t)((op_byte[6] << 16U) & LOW_8BITS_MASK1);
    op_byte[7] = (uint32_t)((uint32_t)(op_byte[7] & LOW_8BITS_MASK) | (((uint32_t)ob_fwdgt_reload << 8U) &
                            LOW_8BITS_MASK1));

    if(FMC_READY == fmc_state) {
        FMC_CTL |= FMC_CTL_BKSEL;
        /* start erase the option byte */
        FMC_CTL |= FMC_CTL_OBER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the BKSEL bit */
        FMC_CTL &= ~FMC_CTL_BKSEL;
        if(FMC_READY == fmc_state) {
            /* reset the OBER bit and enable the option bytes programming */
            FMC_CTL &= ~FMC_CTL_OBER;
            FMC_CTL |= FMC_CTL_OBPG;

            for(i = 0U; i < 8U; i++) {
                OP_BYTE(i) = op_byte[i];
                /* wait for the FMC ready */
                fmc_state = fmc_flash_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY != fmc_state) {
                    break;
                }
            }

