burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_fmc.c
            /* reset the OBPG bit */
            FMC_CTL &= ~FMC_CTL_OBPG;
        } else {
            /* reset the OBER bit */
            FMC_CTL &= ~FMC_CTL_OBER;
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get OB_USER in register FMC_OBSTAT (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     uint8_t, the FMC user option bytes values
*/
uint8_t ob_user_get(void)
{
    /* return the FMC user option bytes value */
    return (uint8_t)((FMC_OBSTAT & FMC_OBSTAT_USER) >> OBSTAT_USER_OFFSET);
}

/*!
    \brief      get OB_DATA in register FMC_OBSTAT (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     uint16_t, ob_data
*/
uint16_t ob_data_get(void)
{
    return (uint16_t)((FMC_OBSTAT & FMC_OBSTAT_DATA) >> OBSTAT_DATA_OFFSET);
}

/*!
    \brief      get the FMC option byte write protection (OB_WP) in register FMC_WP (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     uint32_t, the FMC write protection option bytes value
*/
uint32_t ob_write_protection_get(void)
{
    /* return the FMC write protection option bytes value */
    return (uint32_t)FMC_WP;
}

/*!
    \brief      get the FMC option bytes security protection state (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ob_security_protection_flag_get(void)
{
    FlagStatus spc_state = RESET;

    if(RESET != (FMC_OBSTAT & FMC_OBSTAT_SPC)) {
        spc_state = SET;
    } else {
        spc_state = RESET;
    }
    return spc_state;
}

/*!
    \brief      get the FMC ECC error address in register FMC_ECCCS (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     uint16_t, the FMC ECC error address
*/
uint16_t fmc_ecc_error_address_get(void)
{
    /* return the FMC write protection option bytes value */
    return (uint16_t)((FMC_ECCCS & BITS(16U, 31U)) >> 16U);
}

/*!
    \brief      get FMC flag status (API_ID(0x0027U))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_BUSY: flash busy flag
      \arg        FMC_FLAG_PGSERR: flash program sequence error flag
      \arg        FMC_FLAG_PGERR: flash program error flag
      \arg        FMC_FLAG_PGAERR: flash program alignment error flag
      \arg        FMC_FLAG_WPERR: flash erase/program protection error flag
      \arg        FMC_FLAG_END: flash end of operation flag
      \arg        FMC_FLAG_CBCMDERR: flash checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_FLAG_ECCCOR: single bit ECC error flag
      \arg        FMC_FLAG_ECCDET: double bit ECC error flag
      \arg        FMC_FLAG_SYSECC: system memory flash read ECC error flag
      \arg        FMC_FLAG_MFECC: main flash read ECC error flag
      \arg        FMC_FLAG_OTPECC: OTP read ECC error flag
      \arg        FMC_FLAG_OBECC: OPT read ECC error flag
      \arg        FMC_FLAG_DFECC: data flash read ECC error flag
      \arg        FMC_FLAG_SYSECCBK: ECC error flag in main flash bank or data flash bank
      \arg        FMC_FLAG_OBERR: option bytes error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(fmc_flag_enum flag)
{
    FlagStatus ret;

    /* get flag */
    if(0U != (FMC_REG_VAL(flag) & BIT(FMC_BIT_POS(flag)))) {
        ret = SET;
    } else {
        ret = RESET;
    }

    return ret;
}

/*!
    \brief      clear FMC flag status (API_ID(0x0028U))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_PGSERR: flash program sequence error flag
      \arg        FMC_FLAG_PGERR: flash program error flag
      \arg        FMC_FLAG_PGAERR: flash program alignment error flag
      \arg        FMC_FLAG_WPERR: flash erase/program protection error flag
      \arg        FMC_FLAG_END: flash end of operation flag
      \arg        FMC_FLAG_CBCMDERR: flash checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_FLAG_ECCCOR: single bit ECC error flag
      \arg        FMC_FLAG_ECCDET: double bit ECC error flag
      \arg        FMC_FLAG_MFECC: main flash read ECC error flag
      \arg        FMC_FLAG_OTPECC: OTP read ECC error flag
      \arg        FMC_FLAG_OBECC: OPT read ECC error flag
      \arg        FMC_FLAG_DFECC: data flash read ECC error flag
      \arg        FMC_FLAG_SYSECCBK: ECC error flag in main flash bank or data flash bank
      \arg        FMC_FLAG_OBERR: option bytes error flag
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(fmc_flag_enum flag)
{
    /* clear the flags in STAT/ECCCS register */
    FMC_REG_VAL(flag) = BIT(FMC_BIT_POS(flag));
}

/*!
    \brief      enable FMC interrupt (API_ID(0x0029U))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_ERR: FMC error interrupt
      \arg        FMC_INT_END: FMC end of operation interrupt
      \arg        FMC_INT_ECCCOR: single bit ECC error interrupt
      \arg        FMC_INT_ECCDET: double bit ECC error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(fmc_interrupt_enum interrupt)
{
    /* enable interrupt in CTL0 register */
    FMC_REG_VAL(interrupt) |= BIT(FMC_BIT_POS(interrupt));
}

/*!
    \brief      disable FMC interrupt (API_ID(0x002AU))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_ERR: FMC error interrupt
      \arg        FMC_INT_END: FMC end of operation interrupt
      \arg        FMC_INT_ECCCOR: single bit ECC error interrupt
      \arg        FMC_INT_ECCDET: double bit ECC error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(fmc_interrupt_enum interrupt)
{
    /* disable interrupt in CTL0 register */
    FMC_REG_VAL(interrupt) &= ~BIT(FMC_BIT_POS(interrupt));
}

/*!
    \brief      get FMC interrupt flag status (API_ID(0x002BU))
    \param[in]  int_flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_PGSERR: flash program sequence error interrupt flag
      \arg        FMC_INT_FLAG_PGERR: flash program error interrupt flag
      \arg        FMC_INT_FLAG_PGAERR: flash program alignment error interrupt flag
      \arg        FMC_INT_FLAG_WPERR: flash erase/program protection error interrupt flag
      \arg        FMC_INT_FLAG_END: flash end of operation interrupt flag
      \arg        FMC_INT_FLAG_CBCMDERR: flash checked area by the check blank command is all 0xFF or not interrupt flag
      \arg        FMC_INT_FLAG_ECCCOR: single bit ECC error interrupt flag
      \arg        FMC_INT_FLAG_ECCDET: double bit ECC error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    FlagStatus ret;

